OPENFOAM/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 200000;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 500000;
    }

    outlet
    {
        //type            waveTransmissive;
        //field           p;
        //psi             thermo:psi;
        //gamma           1.4;
        //fieldInf        1;
        //lInf            3;
        //value           uniform 1;
	type            zeroGradient;
    }

    bottom
    {
        type            symmetryPlane;
	
    }

    top
    {
        //type            symmetryPlane;
	type            zeroGradient;
    }

    
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
