OPENFOAM/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
	(0 0 0) //point0
	(0.5 0.0 0.0) //point1
	(0.5 0.126156626101008 0.0) //point2
	(0.0 0.1014640057401272 0.0) //point3
	(-0.5 0.126156626101008 0.0) //point4
	(-0.5 0.0 0.0) //point5
	(0.0 0.0 0.0001) //point6
	(0.5 0.0 0.0001) //point7
	(0.5 0.126156626101008 0.0001) //point8
	(0.0 0.1014640057401272 0.0001) //point9
	(-0.5 0.126156626101008 0.0001) //point10
	(-0.5 0.0 0.0001) //point11
	
	
	
);

blocks
(
    hex (0 1 2 3 6 7 8 9) (50 25 1) simpleGrading (1 1 1)
    hex (5 0 3 4 11 6 9 10) (50 25 1) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (5 4 10 11)
            
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 7 8 2)
        );
    }
    top
    {
        type wall;
        faces
        (
            (3 9 10 4)
	    (2 8 9 3)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            
	    (5 11 6 0)
	    (0 6 7 1)
            
        );
    }
    front
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (5 0 3 4)

        );
    }
    back
    {
        type empty;
        faces
        (
            (6 7 8 9)
            (11 6 9 10)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
